In [32]:
import numpy as np
import pandas as pd

In [33]:
from numpy.random import randn
np.random.seed(103)

In [34]:
df=pd.DataFrame(randn(5,5),['A','B','C','D','E'],['U','V','W','X','Y'])

In [35]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [36]:
df>0

       U      V      W      X      Y
A  False  False   True  False  False
B   True   True   True  False  False
C   True  False   True   True  False
D  False   True  False   True   True
E   True  False   True   True  False

In [37]:
df['X']>0

A    False
B    False
C     True
D     True
E     True
Name: X, dtype: bool

In [38]:
 df[df['X']>0]

          U         V         W         X         Y
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [39]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [40]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [41]:
df['X']+df['Y']

A   -1.470598
B   -1.611977
C    0.392977
D    2.009461
E    1.320381
dtype: float64

In [42]:
sherlock=df[df['U']>0]

In [43]:
sherlock

          U         V         W         X         Y
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [44]:
sherlock['X']

B   -0.980011
C    1.594922
E    1.516358
Name: X, dtype: float64

In [45]:
df[df['U']>0]['X']

B   -0.980011
C    1.594922
E    1.516358
Name: X, dtype: float64

In [46]:
df[df['U']>0][['X','Y']]

          X         Y
B -0.980011 -0.631965
C  1.594922 -1.201945
E  1.516358 -0.195977

In [47]:
ramesh=df['U']>0
sherlock=df[ramesh]
need=['X','Y']
sherlock[need]

          X         Y
B -0.980011 -0.631965
C  1.594922 -1.201945
E  1.516358 -0.195977

In [48]:
df.reset_index()

  index         U         V         W         X         Y
0     A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
1     B  2.327219  0.430793  0.432316 -0.980011 -0.631965
2     C  0.577442 -0.124758  0.978948  1.594922 -1.201945
3     D -1.376369  1.054346 -0.038853  0.680286  1.329175
4     E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [49]:
df

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
D -1.376369  1.054346 -0.038853  0.680286  1.329175
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [50]:
df[(df['U']>0) | (df['W']>0)]

          U         V         W         X         Y
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [51]:
df[(df['U']>0) & (df['W']>0)]

          U         V         W         X         Y
B  2.327219  0.430793  0.432316 -0.980011 -0.631965
C  0.577442 -0.124758  0.978948  1.594922 -1.201945
E  1.283450 -1.758254  0.614306  1.516358 -0.195977

In [52]:
newindex='NA GU KU RA NT'.split()

In [53]:
newindex

['NA', 'GU', 'KU', 'RA', 'NT']

In [54]:
 df['MY']=newindex

In [55]:
df

          U         V         W         X         Y  MY
A -1.249278 -0.260331  0.383793 -0.385461 -1.085137  NA
B  2.327219  0.430793  0.432316 -0.980011 -0.631965  GU
C  0.577442 -0.124758  0.978948  1.594922 -1.201945  KU
D -1.376369  1.054346 -0.038853  0.680286  1.329175  RA
E  1.283450 -1.758254  0.614306  1.516358 -0.195977  NT

In [56]:
df.set_index('MY')

           U         V         W         X         Y
MY
NA -1.249278 -0.260331  0.383793 -0.385461 -1.085137
GU  2.327219  0.430793  0.432316 -0.980011 -0.631965
KU  0.577442 -0.124758  0.978948  1.594922 -1.201945
RA -1.376369  1.054346 -0.038853  0.680286  1.329175
NT  1.283450 -1.758254  0.614306  1.516358 -0.195977